// 6. Написать программу вычисления значения функции y = sin(a). 
// Эту задачу я подсмотрел так как не очень понял как ее решить)
double y(double a)
{
return Math.Sin(a);
}
Console.WriteLine(y(40));