// 8. Вывести на экран числа от -N до N

int max=4;
int min=-4;

while (min<=max)
{
    Console.WriteLine(min);
    min=min+1;
}